WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // Get the current status to determine why ISR called
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  //----------------------------------------------------------
  // Check UIF (Update Interrupt Flag), which indicates CNT changed.
  if(timStatusReg & GTIM_SR_UIF)
  {
    timStatusReg &= ~GTIM_SR_UIF;

    // We need to account for the timer's CNT overflow and use it in the
    // individual input calculations.
    // Note: with a 96 MHz clock a 16-bit timer will rollover every 683
    // microseconds and at 960 kHz it will rollover every 68.3 milliseconds,
    // about 14.6 times/second.
    //
    // What is done here is we have both 16/32-bit timer counts. Which isn't
    // enough. Therefore, we use another 32-bit uint32_t for the overflow
    // value. This approach will effectively add 32-bits to each timers size.
    //
    // This overflow value is for the entire timer and is used each channels
    // in doing calculations.
    mdwFreqTimerInfo->timerOverflow++;
  }

  // Any other interrupts to handle?
  if(timStatusReg == 0)
  {
    // Since there aren't we can exit
    putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
    return OK;
  }

  //----------------------------------------------------------
  // Channel 1
  if(timStatusReg & GTIM_SR_CC1IF)
  {
    timStatusReg &= ~GTIM_SR_CC1IF;

    // Ignore if channel not configured
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_1)
    {
      // Channel data pointer
      mdwFreqChanData_t *mdwFreqChanData = 
              mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_1];
      if(mdwFreqChanData == NULL)
      {
        syslog(LOG_ERR, "%s@%d-Error:Channel 1 is NULL\n", __FILE__, __LINE__);
        return -ENXIO;  // No such device or addres
      }

      // Read the captured value. This resets reg value to 0.
      uint32_t capturedCount = getreg32(timerBase + STM32_GTIM_CCR1_OFFSET);

      // From this point the code is identical for all channels
      // If using duty cycle, read the input GPIO, otherwise only raising
      // edges seen.
      if(mdwFreqChanData->useDutyCycle)
      {
        // With duty cycle we must read the GPIO's input state to determine
        // if this is raising or falling edge.
        if(stm32_gpioread(mdwFreqChanData->inputConfig))
        {
          // Raising edge with duty cycle
          // The end of the previous edge is now the beginning of this count.
          // These are captured so that when the calculations are executed
          // it is free to be unconcerned about changing values.
          // Remember that when an ISR occurs, everything else stops,
          // including the code that does the calculations.
          mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
          mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
          mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
          mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

          // Capture end count and current overflow count
          mdwFreqChanData->endResultCnt = capturedCount;
          mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

          // The following is for calculating average frequency
          mdwFreqChanData->gpioCountForAvg++;
        }
        else
        {
          // Falling edge, only for duty cycle
          mdwFreqChanData->midCaptureCnt = capturedCount;
          mdwFreqChanData->midCaptureOvr = mdwFreqTimerInfo->timerOverflow;
        }
      }
      else
      {
        // Raising edge without duty cycle is end of previous capture and the
        // beginning of a new capture
        mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
        mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
        mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
        mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

        // End is now
        mdwFreqChanData->endResultCnt = capturedCount;
        mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

        // The following is for calculating average frequency
        mdwFreqChanData->gpioCountForAvg++;
      }
    }
  }

  //----------------------------------------------------------
  // Channel 2
  if(timStatusReg & GTIM_SR_CC2IF)
  {
    timStatusReg &= ~GTIM_SR_CC2IF;

    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_2)
    {
      mdwFreqChanData_t *mdwFreqChanData = 
                mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_2];
      if(mdwFreqChanData == NULL)
      {
        syslog(LOG_ERR, "%s@%d-Error:Channel 2 is NULL\n", __FILE__, __LINE__);
        return -ENXIO;  // No such device or addres
      }

      uint32_t capturedCount = getreg32(timerBase + STM32_GTIM_CCR2_OFFSET);

      if(mdwFreqChanData->useDutyCycle)
      {
        if(stm32_gpioread(mdwFreqChanData->inputConfig))
        {
          mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
          mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
          mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
          mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

          mdwFreqChanData->endResultCnt = capturedCount;
          mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

          mdwFreqChanData->gpioCountForAvg++;
        }
        else
        {
          mdwFreqChanData->midCaptureCnt = capturedCount;
          mdwFreqChanData->midCaptureOvr = mdwFreqTimerInfo->timerOverflow;
        }
      }
      else
      {
        mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
        mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
        mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
        mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

        mdwFreqChanData->endResultCnt = capturedCount;
        mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

        mdwFreqChanData->gpioCountForAvg++;
      }
    }
  }

  //----------------------------------------------------------
  // Channel 3
  if(timStatusReg & GTIM_SR_CC3IF)
  {
    timStatusReg &= ~GTIM_SR_CC3IF;

    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_3)
    {
      mdwFreqChanData_t *mdwFreqChanData = 
                mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_3];
      if(mdwFreqChanData == NULL)
      {
        syslog(LOG_ERR, "%s@%d-Error:Channel 3 is NULL\n", __FILE__, __LINE__);
        return -ENXIO;  // No such device or addres
      }

      uint32_t capturedCount = getreg32(timerBase + STM32_GTIM_CCR3_OFFSET);

      if(mdwFreqChanData->useDutyCycle)
      {
        if(stm32_gpioread(mdwFreqChanData->inputConfig))
        {
          mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
          mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
          mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
          mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

          mdwFreqChanData->endResultCnt = capturedCount;
          mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

          mdwFreqChanData->gpioCountForAvg++;
        }
        else
        {
          mdwFreqChanData->midCaptureCnt = capturedCount;
          mdwFreqChanData->midCaptureOvr = mdwFreqTimerInfo->timerOverflow;
        }
      }
      else
      {
        mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
        mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
        mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
        mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

        mdwFreqChanData->endResultCnt = capturedCount;
        mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

        mdwFreqChanData->gpioCountForAvg++;
      }
    }
  }

  //----------------------------------------------------------
  // Channel 4
  if(timStatusReg & GTIM_SR_CC4IF)
  {
    timStatusReg &= ~GTIM_SR_CC4IF;

