WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_4)
    {
      mdwFreqChanData_t *mdwFreqChanData = 
                mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_4];
      if(mdwFreqChanData == NULL)
      {
        syslog(LOG_ERR, "%s@%d-Error:Channel 4 is NULL\n", __FILE__, __LINE__);
        return -ENXIO;  // No such device or addres
      }

      uint32_t capturedCount = getreg32(timerBase + STM32_GTIM_CCR4_OFFSET);

      if(mdwFreqChanData->useDutyCycle)
      {
        if(stm32_gpioread(mdwFreqChanData->inputConfig))
        {
          mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
          mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
          mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
          mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

          mdwFreqChanData->endResultCnt = capturedCount;
          mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

          mdwFreqChanData->gpioCountForAvg++;
        }
        else
        {
          mdwFreqChanData->midCaptureCnt = capturedCount;
          mdwFreqChanData->midCaptureOvr = mdwFreqTimerInfo->timerOverflow;
        }
      }
      else
      {
        mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
        mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
        mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
        mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

        mdwFreqChanData->endResultCnt = capturedCount;
        mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

        mdwFreqChanData->gpioCountForAvg++;
      }
    }
  }

  // Clear the timer's status register
  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  return OK;
}

//=============================================================
// Find the RCC clock for enable for the selected timer
static uint32_t meadow_measure_freq_get_apb_clock(
          mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerAPBClk)
    return STM32_RCC_APB2ENR;
  else
    return STM32_RCC_APB1ENR;
}

//=============================================================
// Timers use 2 different clock sources
static uint32_t meadow_measure_freq_get_max_clock(
          const mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerMaxClk)
    return STM32_APB2_TIM1_CLKIN;
  else
    return STM32_APB1_TIM2_CLKIN;
}

//=============================================================
// Disable the selected timer
static void meadow_measure_freq_disable(const uint32_t timerBase)
{
  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
// Enable the selected timer
static void meadow_measure_freq_enable(const uint32_t timerBase)
{
  // Enable timer Counter
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  // Re-initialize the counter and generates an update of the registers
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=====================================================================
// The following returns the specified timer's information or NULL
static mdwFreqTimerInfo_t *meadow_measure_freq_chk_get_timer_info(
          const uint32_t timerNumb)
{
  mdwFreqTimerInfo_t *timerInfo = &(mdwFreqTimerInfoArray[timerNumb - 1]);
  if(timerInfo->timerUsable)
    return timerInfo;

  return NULL;
}

//=====================================================================
// Returns the correct bit field definition based on the timer's channel
static uint8_t meadow_measure_freq_get_channel_bit(const uint32_t timerChan)
{
  switch(timerChan)
  {
    case FREQ_CHANNEL_NUMBER_CHAN_1:
      return ACTIVE_CHAN_BITFIELD_1;

    case FREQ_CHANNEL_NUMBER_CHAN_2:
      return ACTIVE_CHAN_BITFIELD_2;

    case FREQ_CHANNEL_NUMBER_CHAN_3:
      return ACTIVE_CHAN_BITFIELD_3;

    case FREQ_CHANNEL_NUMBER_CHAN_4:
      return ACTIVE_CHAN_BITFIELD_4;

    default:
      return 0;
  }
}

//==================================================================
// Get the current time in nanoseconds. This is used for the average
// frequency calculations.
static uint64_t meadow_measure_freq_get_current_time(void)
{
  int ret;
  struct tm rtcTime;
  long nsecs;
  long prevNsecs;
  uint64_t returnTime;

  // This function reads the date, time and sub-seconds from the MCU's
  // hardware into a struct tm. However, the STM32F77X Errata warns about a
  // possible problem in ES0334-Rev 9 2.12.1 related to the RTC calendar
  // register not locked properly. Therefore, we'll implement the workaround
  // by reading the nsec twice and compare, if different repeat till equal.
#ifdef CONFIG_STM32F7_HAVE_RTC_SUBSECONDS
  do
  {
    ret = up_rtc_getdatetime_with_subseconds(&rtcTime, &prevNsecs);
    if(ret < 0)
    {
      return ret;
    }

    // Read a second time per Errata
    ret = up_rtc_getdatetime_with_subseconds(&rtcTime, &nsecs);
    if(ret < 0)
    {
      return ret;
    }

    // If they match we have good values
    if(prevNsecs == nsecs)
      break;
      
  } while (1);
#else
  // This function is used if no sub-seconds.
  ret = up_rtc_getdatetime(&rtcTime)
  nsecs = 0;
#endif

  returnTime = mktime(&rtcTime);
  returnTime *= 1000 * 1000 * 1000;
  returnTime += nsecs;

  return returnTime;
}

//=============================================================
// This function will evaluate the GPIO based on 3 tables containing the
// valid GPIOs. For CCM only one table is checked. For F7v1 and F7v2
// The a version specific table is checked, and then the CCM table.
// Returns the channel, 1-4 unless not found, then returns 0.
static uint8_t meadow_measure_freq_get_chan_tim_port_pin(
          const uint32_t timerNumb, uint8_t portAndPin)
{
  int entry;
  int timerOffset = timerNumb - 1;

