WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // Unconfigure no longer needed GPIO
  stm32_unconfiggpio(mdwFreqChanData->inputConfig);

  // If there are no active channels, unconfigure the timer itself.
  // It's clock was already turned off.
  if(channelBit == 0)
  {
    syslog(LOG_INFO, "-->%s@%d-Removing Timer, no remaining channels\n",
              __FILE__, __LINE__);

    // Stop interrupts
    up_disable_irq(mdwFreqTimerInfo->timerIrqVec);

    // Since no remaining channels, stop calling the ISR for overflows
    dierRegVal &= ~GTIM_DIER_UIE;
    putreg16(dierRegVal, timerBase + STM32_GTIM_DIER_OFFSET);

    // No need to auto-reload CNT
    uint16_t regval = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
    regval &= ~GTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
    putreg16(regval, timerBase + STM32_GTIM_CR1_OFFSET);

    // Detach ISR
    ret = irq_detach(mdwFreqTimerInfo->timerIrqVec);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-irq_detach failed, ret:%d, errno:%d\n",
            __FILE__, __LINE__, ret, errno);
      return MEADOW_MEAS_FREQ_UNCFG_IRQ_DETACH_ERR;
    }

    // Disable timer
    meadow_measure_freq_disable(mdwFreqTimerInfo->timerBase);

    // Clear modifiable timer fields
    mdwFreqTimerInfo->timerOverflow  = 0;
    mdwFreqTimerInfo->chanActiveBits = 0;
  }
  else
  {
    // Still active channels so restart the timer clock
    apbClock = meadow_measure_freq_get_apb_clock(mdwFreqTimerInfo);
    modifyreg32(apbClock, 0, mdwFreqTimerInfo->timerClkEn);
  }

  // Free channel runtime memory
  free(mdwFreqChanData);
  mdwFreqChanData = NULL;

  return MEADOW_MEAS_FREQ_UNCFG_SUCCESSFUL;
}

//================================================================
// Return Frequency and Duty Cycle information to caller.
int meadow_measure_freq_return_freq_info(mdwFreqReturnData_t *returnData)
{
  // 64 bytes of stack space
  double dblFrequency;
  double dblDutyCycle;
  double dblTotalInputCount;
  double dblAvgFreq;
  uint64_t halfCycle;
  uint64_t fullCycle;
  uint64_t regOvrFloTimSize;
  uint64_t bgnCapture;
  uint64_t midCapture;
  uint64_t endCapture;
  uint64_t totalCaptureTime;

  // Verify that provided timer and channel are valid
  if(returnData->timerNumber > 14 || returnData->timerNumber < 1)
  {
    syslog(LOG_ERR, "%s@%d-Timer must be 1 - 14\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_INVALID_TIMER_NUMB;
  }

  if(returnData->channelNumber > 4 || returnData->channelNumber < 1)
  {
    syslog(LOG_ERR, "%s@%d-Channel must be 1 - 4\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_INVALID_CHANNEL_NUMB;
  }

  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(returnData->timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Error:Couldn't get TimerInfo from timer number:%lu\n",
          __FILE__, __LINE__, returnData->timerNumber);
    return MEADOW_MEAS_FREQ_READ_TIMER_ACCESS_NULL;
  }

  // syslog(1, "-->%s@%d-Returning data-for timer:%lu, channel:%lu, active channels:0x%02x\n",
  //         __FILE__, __LINE__,
  //         returnData->timerNumber, returnData->channelNumber,
  //         mdwFreqTimerInfo->chanActiveBits);

  // Is the channel configured?
  uint8_t channelBit = meadow_measure_freq_get_channel_bit(
          returnData->channelNumber);
  if((mdwFreqTimerInfo->chanActiveBits & channelBit) == 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:Unconfigured channel accessed\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_CHAN_NOT_CONFIG;
  }

  mdwFreqChanData_t *mdwFreqChanData =
            mdwFreqTimerInfo->mdwFreqChanData[returnData->channelNumber - 1];
  if(mdwFreqChanData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Error:Channel data NULL\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_CHANNEL_DATA_NULL;
  }

  // Does this timer have any channels?
  if(mdwFreqTimerInfo->chanActiveBits == 0)
  {
    // This should be impossible state
    syslog(LOG_ERR, "%s@%d-Error:No channels active\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_NO_CHANS_ACTIVE;
  }

  // Any activity since last this code was last executed?
  if(mdwFreqChanData->gpioCountForAvg == 0)
  {
    returnData->dutyCycleX1000  = 0;
    returnData->frequencyX1000  = 0;
    returnData->avgFreqX1000    = 0;
    returnData->gpioCountForAvg = 0;

    // Reset capture time for next average
    mdwFreqChanData->startTimeForAvg = meadow_measure_freq_get_current_time();
  
    syslog(LOG_ERR, "%s@%d-Error:No freq input since last read\n",
              __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_FREQ_INPUT_NOT_DETECTED;
  }

  //-------------------------------------------------------
  // We need the timer's width to do the overflow math
  if(mdwFreqTimerInfo->timerWidth)
    regOvrFloTimSize = MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
  else
    regOvrFloTimSize = MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;

  uint64_t ovrFloStartCnt = mdwFreqChanData->bgnResultOvr;

  // Add in the overflow counts
  bgnCapture = mdwFreqChanData->bgnResultCnt + \
        ((mdwFreqChanData->bgnResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  midCapture = mdwFreqChanData->midResultCnt + \
        ((mdwFreqChanData->midResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  endCapture = mdwFreqChanData->endResultCnt + \
        ((mdwFreqChanData->endResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  
  // Normalize from the beginning
  fullCycle = endCapture - bgnCapture;
  halfCycle = midCapture - bgnCapture;

  // To preserve resolution, use floating point math.
  // Duty Cycle is the ratio of the full cycle count and the cycle count
  // before the trailing edge was detected.
  if(mdwFreqChanData->useDutyCycle)
    dblDutyCycle = (((double)halfCycle) * 100.0) / ((double)fullCycle);
  else
    dblDutyCycle = 0;
    
  // The dblFrequency is the timer's clock divided by the cycle count.
  dblFrequency = ((double)MEADOW_FREQ_CLOCK_FREQ) / ((double)fullCycle);

  // Average frequency since last calculated
  totalCaptureTime =
            meadow_measure_freq_get_current_time() - \
            mdwFreqChanData->startTimeForAvg;

